app/controllers/boards_controller.rb

INSERT INTO "boards" ("name", "updated_at", "concurrenttasks", "concurrentprojects", "created_at") VALUES('Hei', '2009-03-20 17:43:39', 4, 2, '2009-03-20 17:43:39')
---
  def create
    @board = Board.new(params[:board])
    respond_to do |format|
      if @board.save

SELECT * FROM "boards" WHERE ("boards"."id" = 5)
---
  def find_board
    @board = Board.find(params[:id])

SELECT * FROM "tasks" WHERE ("tasks".board_id = 4 AND (state = 1 AND project = 'false'))
---
  def find_by_state_and_project(state, project)
    @board.tasks.find(:all, :conditions => ["state = ? and project = ?", state, project ])

UPDATE "boards" SET "concurrentprojects" = 1, "updated_at" = '2009-05-04 21:17:29' WHERE "id" = 4
---
  def update

    respond_to do |format|
      if @board.update_attributes(params[:board])

DELETE FROM "boards" WHERE "id" = 5
---
  def destroy
    @board.destroy