app/controllers/events_controller.rb

SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def show
    @event = Event.find(params[:id])

INSERT INTO "events" ("updated_at", "title", "details", "end", "start", "span", "created_at") VALUES('2009-11-17 12:03:56', 'ICC oppgradering', 'Oppgradering til 9.2. Ny HEP må være på plass...', '2010-03-01', '2009-11-17', 't', '2009-11-17 12:03:56')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save