app/controllers/tasks_controller.rb

SELECT * FROM "boards" WHERE ("boards"."id" = 4)
SELECT * FROM "tasks" WHERE ("tasks"."board_id" IS NULL AND "tasks"."state" = '3') LIMIT 1
---
  def index
    @board = Board.find(params[:board_id])
    @tasks = Task.find(:all, :conditions =>['board_id = ? and state = ?', @board, params[:state]])

SELECT * FROM "boards" WHERE ("boards"."id" = 4)
---
  def new
    @board = Board.find(params[:board_id])

SELECT * FROM "boards" WHERE ("boards"."id" = 4)
INSERT INTO "tasks" ("name", "updated_at", "project", "consequence", "description", "value", "board_id", "created_at", "state") VALUES('aSDASd', '2009-11-06 18:04:25', 'f', 'dfsdsfadsf', 'asdfdsafadsf', 'dsafdsfdsf', 4, '2009-11-06 18:04:25', 0)
---
  def create
    @board = Board.find(params[:board_id])
    @task = @board.tasks.build(params[:task])

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "description" = 'Nytt presentasjonsverktøy over ICC for krafsentralen og hydrologi.', "updated_at" = '2009-03-17 15:27:10' WHERE "id" = 1
---
  def set_state_and_redirect(state)
    @task.state = state
    @task.save

DELETE FROM "tasks" WHERE "id" = 4
---
  def destroy
    @task.destroy

SELECT * FROM "boards" WHERE ("boards"."id" = 4)
SELECT * FROM "tasks" WHERE ("tasks".board_id = 4 AND (state = 2 and project = 't'))
---
  def find_task
    @board = Board.find(params[:board_id])
    @task = @board.tasks.find(params[:id])